{"_id":"team-member-0","_type":"teamMember","name":"Dr. Satwinder Bains","desc":"Dr. Satwinder Bains provides overall direction, management, and support for research. She leads the outreach component and community engagement with the goal of creating educational and participatory materials.","_role":"Director"}
{"_id":"team-member-1","_type":"teamMember","name":"Thamilini Jothilingam","desc":"Thamilini Jothilingam leads the archival recording, manages content development, and supports the oral history interviews, transcription, and narratives. She supports student researchers, community historians, and community leaders.","_role":"Digital Archivist"}
{"_id":"team-member-2","_type":"teamMember","name":"Annet Holierhoek","desc":"Annet Holierhoek oversees the website's development and design, ensuring alignment with project goals. She collaborates with researchers and designers to maintain accuracy and accessibility, integrating feedback and media seamlessly.","_role":"Financial manager"}
{"_id":"team-member-3","_type":"teamMember","name":"Dr. Anushay Malik","desc":"Dr. Anushay Malik, PhD, Senior Lecturer at SFU, is the contracted consultant who leads the research on the project. She brings a wealth of knowledge, lived experience, and research expertise as a young Muslim Canadian scholar.","_role":"South Asian Research Fellow","years":"2024/25"}
{"_id":"team-member-4","_type":"teamMember","name":"Kiara Dabreo","desc":"Kiara Dabreo conducts historical and archival research on early South Asian Canadian Muslims in British Columbia immigrants in BC, creating an archival collection, preserving records, and cataloging key individuals, organizations, and settlement locations. <p><a href=\"https://blogs.ufv.ca/sasi/2024/05/16/sasis-research-assistant-kiara-dabreo-presents-at-ufvs-student-research-day/\" target=\"_blank\" rel=\"noopener\"> Research output </a></p>","_role":"Research Assistant","years":"2024/25"}
{"_id":"team-member-5","_type":"teamMember","name":"Samarah Saddique","desc":"Samarah Siddique contributes to the BC Muslim Social History Project as a Research and Cataloguing Assistant. She conducts interviews with South Asian Canadian Muslims in British Columbia community members across BC and digitally archives their narratives. <p><a href=\"https://blogs.ufv.ca/sasi/2025/04/09/sasi-research-assistant-presents-at-student-research-day/\" target=\"_blank\" rel=\"noopener\"> Research output </a></p>","_role":"Research Assistant","years":"2024/25"}
{"_id":"team-member-6","_type":"teamMember","name":"Sadhik Preet Singh","desc":"Sadhik Preet Singh contributes to the BC Muslim Social History Project as a video editor and transcriber, also conducting interviews with South Asian Canadian Muslims in British Columbia community members across BC to document their stories.","_role":"Research Assistant","years":"2024/25"}
{"_id":"team-member-7","_type":"teamMember","name":"Saumyaa Gelani","desc":"Saumyaa Gelani contributes to the South Asian Canadian Muslims in BC Project as a Research Assistant and plays a key role in the website’s design. She ensures that the design is engaging and easy to use.","_role":"Research Assistant","years":"2024/25"}
{"_id":"team-member-8","_type":"teamMember","name":"Rashneet","desc":"Rashneet contributes to the South Asian Canadian Muslims in BC Project as a graphic designer and research assistant. She develops the project’s design identity and creates the foundational website design.","_role":"Research Assistant","years":"2024/25"}
{"_id":"team-member-9","_type":"teamMember","name":"Arnav Mehta","desc":"Arnav Mehta contributes to the project by developing and hosting the website. He implements animations, ensures smooth functionality, and optimizes the platform to align with the project’s goals.","_role":"Research Assistant","years":"2024/25"}
{"_id":"committee-member-0","_type":"committee","name":"Dr. Satwinder Bains, PhD","position":"Director, South Asian Studies Institute","desc":"Satwinder Bains is Director of the South Asian Studies Institute and Associate Professor in the School of Culture, Media and Society, College of Arts. <br /> Dr. Bains’ research interests include the study of the impact of language, culture, and identity on South Asian Canadian migration, settlement, and integration. She teaches anti-racist curriculum implementation; identity politics; migration and politics in the South Asian Canadian Diaspora and Punjabi Canadian cultural historiography.","img":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/advisory_committee/Satwinder-Bains-2021.jpg"}}
{"_id":"committee-member-1","_type":"committee","name":"Dr. Awneet Sivia, PhD","position":"Associate Vice President, Teaching and Learning","desc":"Dr. Awneet Sivia is the Associate Vice President of Teaching and Learning, and has been an Associate Professor, Director, and Chair of programs in the School of Education at UFV. She is a passionate educator and researcher in social justice/antiracist pedagogy, science education, teacher identity, faculty development, and educational leadership.<br /><br />Dr. Sivia’s academic publications can be found in Studying Teacher Education, In Education, Canadian Journal of Scholarship of Teaching and Learning, Journal of Education, and in books published by Brill, Sense, and Lexington. Her current research interests include decolonizing methodologies, rehumanizing science education, narratives of racism/antiracism in teacher education, leadership in online education, and early career faculty experiences.<br /><br />Dr. Sivia leads numerous institutional initiatives, including the Institutional Learning Outcomes, the AI Task Force, the Learning Management System Project, Changemaker Education, Indigenizing new faculty development, and policy revisions. She has been a speaker at TEDx Abbotsford and has been honored with several provincial and national teaching awards, including the 3M National Teaching Fellowship.","img":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/advisory_committee/Awneet%20Sivia.jpg"}}
{"_id":"committee-member-2","_type":"committee","name":"Dr. Jas Uppal, PhD","position":"Assistant Professor, Teacher Education Program","desc":"Dr. Jas Uppal’s teaching experiences are vast and span not only grades and subjects, but also countries and curriculums. Her experience mirrors the lifecycle of the teacher: K-12 teaching of science and math, mentoring pre-service teachers at the school level, teaching and mentoring re-certifying teachers and pre-service teachers in international teacher education.<br /><br />Dr. Uppal has also trained and built teacher capacity through programs in the U.K, through a study abroad program in India and a district mentoring program for 300+ teachers, as well as themed graduate diploma programs for practicing teachers. Her master’s degree focused on educational change, including assessment for learning, and teacher identity.<br /><br />During Dr. Uppal's doctoral studies, she researched pedagogical dynamics in encounters with difference through centering inequitable power relations. Dr. Uppal’s research reflects her passion and commitment to take continuous risks to learn and unlearn who she is as an educator.","img":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/advisory_committee/juhershorn.img.2140374917.jpg"}}
{"_id":"committee-member-3","_type":"committee","name":"Dr. Hassan Javid, PhD","position":"Associate Professor, School of Culture, Media and Society","desc":"Dr. Hassan Javid is an Associate Professor of Sociology in the School of Culture, Media and Society at UFV.<br /><br />Prior to joining UFV, Dr Javid held academic positions at the Lahore University of Management Sciences and at the London School of Economics. His work focuses on the legacies of colonialism in South Asia, focusing on processes of democratization and the mechanisms through which elite power is reproduced.","img":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/advisory_committee/2024-Hassan-Javid.jpg"}}
{"_id":"committee-member-4","_type":"committee","name":"Shahzad Nazir Khan, P.Ag","position":"Professional Agrologist","desc":"Shahzad Nazir Khan is a Professional Agrologist with an M. Sc (Hons) Agriculture and an MBA.<br /><br />Mr. Nazir Khan is a well-known peace and social justice activist of the South Asian community who immigrated to Canada from Pakistan back in 2006. For the last many years, he and his group of Progressive Pakistani Canadians took many initiatives to raise awareness about peace and issues related to the South Asian diaspora.<br /><br />He celebrates ‘unity in diversity’.","img":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/advisory_committee/Shahzad-Nazir-Khan-2.png"}}
{"_id":"partner-0","_type":"partner","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/heritage%20logo%20in%20the%20middle.png"},"name":"Heritage Logo","website":"https://www.southasiancanadianheritage.ca/","years":"2024-present"}
{"_id":"partner-1","_type":"partner","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/Sacda-logo.svg"},"name":"SACDA Logo","website":"https://sacda.ca","years":"2024-present"}
{"_id":"partner-2","_type":"partner","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/abb%20muslim%20CC%20logo.png"},"name":"Abbotsford Muslim Community Center Logo","website":"https://org.thebcma.com/abbotsford/","years":"2024-present"}
{"_id":"sponsor-0","_type":"sponsor","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/cece%20logo.png"},"name":"CECE Logo","website":"https://www.ufv.ca/jobs/","years":"2024-2025"}
{"_id":"sponsor-1","_type":"sponsor","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/reserach%20and%20grad%20stud%20logo.png"},"name":"Research and Graduate Studies Logo","website":"https://www.ufv.ca/research/","years":"2024-2025"}
{"_id":"sponsor-2","_type":"sponsor","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/south%20asian%20fellowship%20logo.png"},"name":"South Asian Fellowship Logo","website":"https://www.ufv.ca/sasi/research/fellowship/","years":"2024-2025"}
{"_id":"sponsor-3","_type":"sponsor","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/UFV_SASI_logo.png"},"name":"UFV SASI Logo","website":"#","years":"2024-present"}
{"_id":"sponsor-4","_type":"sponsor","logo":{"_type":"image","_sanityAsset":"image@file:///home/devnull03/work/ufv/muslims-in-bc-exhibit/static/content/Hari%20Sharma%20logo.png"},"name":"Hari Sharma Foundation Logo","website":"https://harisharma.org/","years":"2024"}
